var hsk1_chars1 = ["一","七","三","上","下","不","东","两","个","中","么","九","也","习","书","买","了","事","二","五","些","京","人","什","今","介","从","他","们","休","会","住","体","作","你","候","假","做","儿","元","先","八","六","关","兴","再","写","冷","净","准","几","出","分","别","到","前","动","包","北","医","十","午","半","南","去","友","口","叫","右","号","吃","同","名","后","吗","吧","听","告","呢","和","哥","哪","唱","商","喜","喝","四","回","国","图","在","地","场","坏","坐","块","备","外","多","大","天","太","女","奶","她","好","妈","妹","姐","子","字","学","孩","客","家","对","小","少","就","山","岁","工","左","差","师","帮","常","干","年","床","店","开","弟","影","很","得","忘","忙","快","怎","息","您","想","慢","我","房","手","打","找","拿","放","教","文","新","方","旁","日","早","时","明","星","昨","是","晚","最","月","有","朋","服","期","本","机","条","来","杯","果","树","校","样","桌","楼","次","欢","歌","正","比","毛","气","水","汉","汽","没","洗","渴","火","点","热","爱","爷","爸","牛","玩","现","班","球","生","用","电","男","病","白","百","的","看","真","着","睡","知","票","穿","站","笑","第","等","答","米","系","累","绍","给","网","老","考","肉","能","脑","花","茶","菜","蛋","行","衣","西","要","见","视","觉","认","记","识","诉","试","话","语","说","请","读","课","谁","谢","贵","走","起","跑","跟","路","身","车","边","过","还","这","进","远","送","道","那","都","里","重","钱","错","门","问","间","院","难","雨","零","非","面","页","风","飞","饭","饿","馆","马","高","鸡","万","且","业","为","主","举","久","乐","于","云","交","亮","亿","以","件","份","但","位","低","使","例","便","信","倒","借","停","健","像","克","入","全","公","共","其","典","养","冬","凉","划","刚","利","刻","力","办","加","务","助","努","千","单","卖","占","卡","印","原","参","又","发","取","受","变","句","只","可","司","合","向","吹","周","味","咱","响","哭","啊","喂","喊","嘴","因","园","堂","墙","声","处","复","夏","夜","够","头","套","如","姓","它","安","完","定","宜","实","室","封","层","己","已","市","带","平","广","应","度","座","庭","康","弄","当","往","心","必","忽","态","怕","思","急","情","惯","意","感","愿","懂","成","或","所","才","护","报","拉","挺","换","掉","排","接","推","提","收","改","故","数","斤","旅","春","晨","普","晴","更","末","板","查","检","椅","楚","段","永","求","河","油","法","活","流","海","清","温","游","湖","满","漂","澡","灯","然","照","熟","爬","片","物","特","狗","猫","王","理","瓶","由","画","留","疼","目","直","相","省","眼","睛","短","确","碗","碰","示","礼","离","秋","科","租","称","空","笔","筷","算","篇","篮","红","级","纸","练","组","经","结","绩","绿","者","而","育","背","脏","脚","脸","腿","自","舒","般","船","色","节","英","草","药","蓝","虽","街","表","装","观","角","言","计","讨","让","讲","许","论","词","该","超","越","轻","辆","迎","运","近","适","选","通","遍","部","酒","量","钟","铁","银","长","闻","队","阳","阴","际","随","雪","青","静","靠","鞋","音","顺","须","顾","题","颜","食","餐","饱","饺","骑","鱼","鸟","黄","黑"];

var charsToIgnore1 = [
    "。",
    "，",
    "?",
    "!",
    "！",
    "？",
    " "
];

var evaluator = function(sentence) {
    for (var i = 0; i < sentence.length; i++) {
        var char = sentence[i];
        if (charsToIgnore1.indexOf(char) > -1) {
            continue;
        }
        if (hsk1_chars1.indexOf(char) < 0) {
            debugger;
            return false;
        }
    }
    return true;
}

var evaluateSentence = function (sentence) {
    console.log(evaluator(sentence));
}

var sentenceToEvaluate = "她太高了，睡不着我的床。";

evaluateSentence(sentenceToEvaluate);